Repository: ArmGono/drupal.ru
Catalog: sites/all/translations/ban_user-7.x-1.0.*.po
Languages: ru

source: More
ru: Ещё

source: Name
ru: Название

source: User ID
ru: ID Пользователя

source: Last update
ru: Последнее обновление

source: Forum
ru: Форум

source: Deadline
ru: Срок завершения

source: Message for a banned user
ru: Сообщение для заблокированного пользователя

source: This account has been temporarily suspended. You will be able to access the site again on [ban-deadline].
ru: Эта учётная запись была временно заблокирована. Вы сможете снова получить доступ к сайту через [ban-deadline].

source: Preferred date format
ru: Предпочтительный формат даты

source: No banned users are found.
ru: Заблокированных пользователей не найдено.

source: Pardon selected users
ru: Простить выбранных пользователей

source: Ban User
ru: Блокирование пользователя

source: The user is not banned.
ru: Этот пользователь разблокирован.

source: Don't ban user
ru: Не блокировать пользователя

source: Length of the ban
ru: Продолжительность блокировки

source: Selecting any time length and saving this form will re-add the specified ban length from the current date, even if a ban has already been set.
ru: Выбор любой продолжительности и сохранение этой формы будет заново вычислять продолжительность блокировки от текущей даты, даже если блокировка уже была установлена.

source: Ban users for a limited time
ru: Временно заблокировать пользователей
