Repository: ArmGono/drupal.ru
Catalog: sites/all/translations/gravatar-7.x-1.1.*.po
Languages: ru

source: Advanced
ru: Расширенные

source: View user profile.
ru: Просмотр профиля пользователя.

source: @user's picture
ru: Аватар пользователя @user

source: Default image
ru: Изображение по умолчанию

source: Please check the following potential issues: !issues
ru: Пожалуйста, проверьте следующие пункты: !issues

source: Image maturity filter
ru: Категория изображения

source: G: Suitable for display on all websites with any audience type.
ru: G: Пригодны для показа на сайтах с любой аудиторией.

source: PG: May contain rude gestures, provocatively dressed individuals, the lesser swear words, or mild violence.
ru: PG: Могут содержать неприличные жесты, провокационно одетых людей, грубые выражения или умеренную жестокость.

source: R: May contain such things as harsh profanity, intense violence, nudity, or hard drug use.
ru: R: Могут быть оскорбительными, содержать сцены жестокости, обнаженные тела или связанные с наркотиками.

source: X: May contain hardcore sexual imagery or extremely disturbing violence.
ru: X: Могут содержать откровенные сексуальные изображения или сцены экстремальной жестокости.

source: Global default user image
ru: Изображение по умолчанию

source: Module default image (white background)
ru: Изображение поставляемое с модулем (белый фон)

source: Module default image (transparent background)
ru: Изображение поставляемое с модулем (прозрачный фон)

source: Gravatar.com identicon (generated)
ru: Gravatar.com уникальный узор (генерируется)

source: Gravatar.com wavatar (generated)
ru: Gravatar.com рожицы (генерируется)

source: Gravatar.com monsterid (generated)
ru: Gravatar.com монстры (генерируется)

source: Gravatar.com logo
ru: Логотип Gravatar.com

source: Default picture example
ru: Пример изображения по умолчанию

source: This setting can be adjusted in the <a href="@user-picture-link">user pictures settings</a>.
ru: Этот параметр может быть указан на странице <a href="@user-picture-link">настроек пользователей</a>.

source: There currently is not a global default user picture specified.
ru: В настоящее время, изображение по умолчанию не указано.

source: Do not modify these options unless you know what you are doing!
ru: Не изменяйте эти параметры, если не знаете что делаете!

source: use gravatar
ru: использовать gravatar

source: Make sure <a href="@user-settings-link">user picture support</a> is enabled to allow gravatar integration.
ru: Убедитесь, что включена <a href="@user-settings-link">поддержка изображений</a>, которая требуется для интеграции с Gravatar.

source: There are no user roles that have the <a href="@permissions-link">%permission permission</a>.
ru: Дайте пользователям <a href="@permissions-link">права на использование Gravatar</a>.

source: Make sure user pictures are enabled in your <a href="@theme-settings">theme</a> settings.
ru: Убедитесь, что отображение аватаров включено в <a href="@theme-settings">настройках вашей темы</a>.

source: Administer Gravatar integration.
ru: Управление модулем Gravatar.

source: If you have a <a href="@gravatar-website">Gravatar</a> account associated with the e-mail address you provide, it will be used to display your avatar.
ru: Если у вас есть учётная запись в <a href="@gravatar-website">Gravatar</a>, связанная с этим e-mail адресом, то она будет использована для отображения аватара.

source: If you have a <a href="@gravatar-check">valid Gravatar</a> associated with your e-mail address, use it for your user picture.
ru: Если у вас есть <a href="@gravatar-check">действительный Gravatar</a>, связанный с вашим адресом электронной почты, использовать его для изабражений вашего пользователя.

source: Your Gravatar will not be shown if you upload a user picture.
ru: Ваш Gravatar не будет отображаться, если вы загрузите изображение пользователя.
